recipe_manager_api/app/blueprints/recipe_blueprint.rb

SELECT "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = 13
---
  fields :title, :servings, :cooking_time, :favorite, :shopping_list, :description, :created_at, :updated_at
    # keeping nested attributes unserialized for now due to the complexity of the recipe controller's custom methods. Improvement opportunity.
    field :instructions do |recipe, _opts|
      recipe.instructions.map do |inst|

SELECT "ingredient_lists".* FROM "ingredient_lists" WHERE "ingredient_lists"."recipe_id" = 13
---
    end

    field :ingredient_lists do |recipe, _opts|
      recipe.ingredient_lists.map do |list|