recipe_manager_api/app/controllers/application_controller.rb

  def authenticate_request
    header = request.headers["Authorization"]
    header = header.split(" ").last if header
    begin
      decoded = JWT.decode(header, Rails.application.credentials.secret_key_base).first
      @current_user = User.find(decoded["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1