recipe_manager_api/app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    render json: IngredientBlueprint.render(Ingredient.all)