recipe_manager_api/app/controllers/recipes_controller.rb

  def index
    current_user = User.first
    #TODO delete line above once done testing
    @recipes = current_user.recipes.includes(:labels, :ingredient_lists, :instructions)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "ingredient_lists".* FROM "ingredient_lists" WHERE "ingredient_lists"."recipe_id" = 4
SELECT "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = 4
SELECT "labels".* FROM "labels" WHERE "labels"."recipe_id" = 4

  def create
    current_user = User.first
    #TODO delete line above once done testing

    # Kay, moved ingredient processing from model to controller with Bun's help - hopefully, this'll work!

    recipe_data = recipe_params.deep_dup

    # Preprocess ingredient_lists_attributes to handle ingredient lookup/creation
  if recipe_data[:ingredient_lists_attributes].present?
  ingredient_lists = recipe_data[:ingredient_lists_attributes]

  # Handles both array-style (most common) and hash-style (Rails forms)
    if ingredient_lists.is_a?(Array)
      ingredient_lists.each do |list|
        next unless list[:ingredient_attributes]&.dig(:ingredient).present?
        ingredient_name = list[:ingredient_attributes][:ingredient].strip
        ingredient = Ingredient.where('lower(ingredient) = ?', ingredient_name.downcase).first_or_create(ingredient: ingredient_name)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "ingredients".* FROM "ingredients" WHERE (lower(ingredient) = 'flour') ORDER BY "ingredients"."id" ASC LIMIT 1
SELECT 1 AS one FROM "ingredients" WHERE LOWER("ingredients"."ingredient") = LOWER('Banana') LIMIT 1
INSERT INTO "ingredients" ("ingredient", "created_at", "updated_at") VALUES ('Ground beef', '2025-07-28 09:51:23.842440', '2025-07-28 09:51:23.842440') RETURNING "id"
SELECT "ingredients".* FROM "ingredients" WHERE (lower(ingredient) = 'ground beef') ORDER BY "ingredients"."id" ASC LIMIT 1

    end
  end

  label_attributes = recipe_data.delete(:label_attributes) || {
---
DELETE FROM "labels" WHERE "labels"."id" = 10


  @recipe = current_user.recipes.build(recipe_data)
  @recipe.build_label(label_attributes)
    if @recipe.save
---
INSERT INTO "labels" ("recipe_id", "vegetarian", "vegan", "gluten_free", "dairy_free", "created_at", "updated_at") VALUES (3, 0, 0, 0, 0, '2025-08-03 19:28:02.209258', '2025-08-03 19:28:02.209258') RETURNING "id"
INSERT INTO "recipes" ("user_id", "title", "servings", "cooking_time", "favorite", "shopping_list", "created_at", "updated_at") VALUES (3, 'Lemon Garlic Chicken', 4, 45, 1, 0, '2025-08-03 19:28:02.205177', '2025-08-03 19:28:02.205177') RETURNING "id"

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "title" = 'New Lemon Garlic Chicken', "updated_at" = '2025-08-03 19:39:34.460474' WHERE "recipes"."id" = 4

  def instructions
    current_user = User.first # Remove later
    recipe = current_user.recipes.find(params[:id])
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 2 AND "recipes"."id" = 1 LIMIT 1

  def create_instruction
    current_user = User.first # Remove later
    recipe = current_user.recipes.find(params[:id])
    instruction = recipe.instructions.build(instruction_params)
    if instruction.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 3 AND "recipes"."id" = 4 LIMIT 1
INSERT INTO "instructions" ("recipe_id", "step_number", "step_content", "created_at", "updated_at") VALUES (4, 3, 'Simmer with tomato sauce for 30 minutes.', '2025-08-03 19:41:03.108739', '2025-08-03 19:41:03.108739') RETURNING "id"

  def update_instruction
    current_user = User.first # Remove later
    recipe = current_user.recipes.find(params[:recipe_id])
    instruction = recipe.instructions.find(params[:instruction_id])
    if instruction.update(instruction_params)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 3 AND "recipes"."id" = 4 LIMIT 1
SELECT "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = 4 AND "instructions"."id" = 3 LIMIT 1
UPDATE "instructions" SET "step_number" = 2, "step_content" = 'Fix the garlic instruction', "updated_at" = '2025-08-03 20:05:00.269771' WHERE "instructions"."id" = 11

  def destroy_instruction
    current_user = User.first # Remove later
    recipe = current_user.recipes.find(params[:recipe_id])
    instruction = recipe.instructions.find(params[:instruction_id])
    instruction.destroy
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 3 AND "recipes"."id" = 4 LIMIT 1
SELECT "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = 4 AND "instructions"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 2 AND "recipes"."id" = 1 LIMIT 1
DELETE FROM "instructions" WHERE "instructions"."id" = 11

  def ingredient_lists
    current_user = User.first # Remove later
    recipe = current_user.recipes.find(params[:id])
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 3 AND "recipes"."id" = 4 LIMIT 1

  def create_ingredient_list
    current_user = User.first # Remove later
    recipe = current_user.recipes.find(params[:id])
    ingredient_list_data = ingredient_list_params.deep_dup

    # Check for nested ingredient attributes
    if ingredient_list_data[:ingredient_attributes] && ingredient_list_data[:ingredient_attributes][:ingredient].present?
      ingredient_name = ingredient_list_data[:ingredient_attributes][:ingredient].strip
      ingredient = Ingredient.where('lower(ingredient) = ?', ingredient_name.downcase).first_or_create(ingredient: ingredient_name)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 2 AND "recipes"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT 1 AS one FROM "ingredients" WHERE LOWER("ingredients"."ingredient") = LOWER('Vegetable broth') LIMIT 1
SELECT "ingredients".* FROM "ingredients" WHERE (lower(ingredient) = 'vegetable broth') ORDER BY "ingredients"."id" ASC LIMIT 1
INSERT INTO "ingredients" ("ingredient", "created_at", "updated_at") VALUES ('Vegetable broth', '2025-07-28 10:07:18.491843', '2025-07-28 10:07:18.491843') RETURNING "id"
INSERT INTO "ingredient_lists" ("ingredient_id", "recipe_id", "metric_qty", "metric_unit", "imperial_qty", "imperial_unit", "created_at", "updated_at") VALUES (5, 4, 300.0, 'ml', 10.1, 'fl oz', '2025-08-03 19:43:06.065267', '2025-08-03 19:43:06.065267') RETURNING "id"

  def update_ingredient_list
    current_user = User.first # Remove later
    recipe = current_user.recipes.find(params[:recipe_id])
    ingredient_list = recipe.ingredient_lists.find(params[:ingredient_list_id])
    if ingredient_list.update(ingredient_list_params)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 2 AND "recipes"."id" = 1 LIMIT 1
SELECT "ingredient_lists".* FROM "ingredient_lists" WHERE "ingredient_lists"."recipe_id" = 4 AND "ingredient_lists"."id" = 10 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 3 AND "recipes"."id" = 4 LIMIT 1
UPDATE "ingredient_lists" SET "metric_qty" = 250.0, "imperial_qty" = 8.8, "updated_at" = '2025-07-27 03:22:24.159243' WHERE "ingredient_lists"."id" = 1

  def destroy_ingredient_list
    current_user = User.first # Remove later
    recipe = current_user.recipes.find(params[:recipe_id])
    ingredient_list = recipe.ingredient_lists.find(params[:ingredient_list_id])
    ingredient_list.destroy
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 3 AND "recipes"."id" = 4 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "ingredient_lists".* FROM "ingredient_lists" WHERE "ingredient_lists"."recipe_id" = 4 AND "ingredient_lists"."id" = 10 LIMIT 1
DELETE FROM "ingredient_lists" WHERE "ingredient_lists"."id" = 10

  def show_labels
    current_user = User.first # Temporary
    recipe = current_user.recipes.find(params[:id])
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 2 AND "recipes"."id" = 2 LIMIT 1

  def update_labels
    current_user = User.first # Temporary
    recipe = current_user.recipes.find(params[:id])
    label = recipe.label || recipe.build_label

    if label.update(label_params)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 2 AND "recipes"."id" = 2 LIMIT 1
UPDATE "labels" SET "vegetarian" = 1, "dairy_free" = 0, "updated_at" = '2025-08-03 19:47:21.421177' WHERE "labels"."id" = 3

  def set_recipe
    current_user = User.first
    #TODO delete line above once done testing
    @recipe = current_user.recipes.find(params[:id])
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 3 AND "recipes"."id" = 4 LIMIT 1