recipe_manager_api/app/controllers/recipes_controller.rb

  def create
    recipe_data = recipe_params.deep_dup

    # process ingredient lists using service object instead
    IngredientProcessorService.process_ingredient_lists(recipe_data[:ingredient_lists_attributes])

    # extract label attributes w defaults
    label_attributes = recipe_data.delete(:label_attributes) || default_label_attributes

      @recipe = current_user.recipes.build(recipe_data)
      @recipe.build_label(label_attributes)

      if params[:picture].present?
        @recipe.picture.attach(params[:picture])
      end

      if @recipe.save
---
INSERT INTO "labels" ("recipe_id", "vegetarian", "vegan", "gluten_free", "dairy_free", "created_at", "updated_at") VALUES (13, 1, 1, 0, 0, '2025-09-18 10:37:48.303351', '2025-09-18 10:37:48.303351') RETURNING "id"
INSERT INTO "recipes" ("user_id", "title", "servings", "cooking_time", "favorite", "shopping_list", "created_at", "updated_at", "description") VALUES (10, 'title', 1, 15, 0, 0, '2025-09-18 10:37:48.300689', '2025-09-18 10:37:48.300689', 'love it') RETURNING "id"
INSERT INTO "labels" ("recipe_id", "vegetarian", "vegan", "gluten_free", "dairy_free", "created_at", "updated_at") VALUES (11, 1, 0, 0, 0, '2025-09-18 10:53:07.198005', '2025-09-18 10:53:07.198005') RETURNING "id"

  def update
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "shopping_list" = 0, "updated_at" = '2025-09-18 11:09:37.208450' WHERE "recipes"."id" = 12

  def create_instruction
    recipe = find_user_recipe
    instruction = recipe.instructions.build(instruction_params)

    if instruction.save
---
INSERT INTO "instructions" ("recipe_id", "step_number", "step_content", "created_at", "updated_at") VALUES (1, 5, 'Let cool before slicing.', '2025-07-27 01:22:55.844712', '2025-07-27 01:22:55.844712') RETURNING "id"

  def update_instruction
    recipe = find_user_recipe(params[:recipe_id])
    instruction = recipe.instructions.find(params[:instruction_id])
---
SELECT "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = 2

  def destroy_instruction
    recipe = find_user_recipe(params[:recipe_id])
    instruction = recipe.instructions.find(params[:instruction_id])
---
SELECT "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = 3

  def update_ingredient_list
    recipe = find_user_recipe(params[:recipe_id])
    ingredient_list = recipe.ingredient_lists.find(params[:ingredient_list_id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = 4 LIMIT 1
SELECT "ingredient_lists".* FROM "ingredient_lists" WHERE "ingredient_lists"."recipe_id" = 1

  def destroy_ingredient_list
    recipe = find_user_recipe(params[:recipe_id])
    ingredient_list = recipe.ingredient_lists.find(params[:ingredient_list_id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = 3 LIMIT 1