recipe_manager_api/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "email_confirmation", "password", "password_digest", "first_name", "last_name", "preferred_system", "created_at", "updated_at") VALUES ('l@l', NULL, NULL, '$2a$12$HeAXtonVpZNTjQSYTVDG8OGmjxa7bIGM2m.PLU57ZJa4Z253t1SFG', 'l', 'l', 'metric', '2025-08-27 02:26:32.639852', '2025-08-27 02:26:32.639852') RETURNING "id"
---
  def create
    @user = User.new(user_params)
      if params[:profile_picture].present?
        @user.profile_picture.attach(params[:profile_picture])

SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
UPDATE "users" SET "updated_at" = '2025-08-27 02:28:01.202170' WHERE "users"."id" = 6
---
  def update
    @user = User.find(params[:id])
      if @user.update(user_params)