recipe_manager_api/app/controllers/concerns/recipe_findable.rb

SELECT "ingredient_lists".* FROM "ingredient_lists" WHERE "ingredient_lists"."recipe_id" = 11
SELECT "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = 11
SELECT "labels".* FROM "labels" WHERE "labels"."recipe_id" = 11
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 10 AND "recipes"."id" = 11 LIMIT 1
---
  def find_user_recipe_with_associations(recipe_id = params[:id])
    current_user.recipes.includes(:label, :ingredient_lists, :instructions).find(recipe_id)