recipe_manager_api/app/services/ingredient_processor_service.rb

  def self.find_or_create_ingredient(ingredient_name)
    # apparently, using find_by with downcase allows for better performance compared to SQL 'where' function
    Ingredient.find_by('LOWER(ingredient) = ?', ingredient_name.downcase) ||
      Ingredient.create!(ingredient: ingredient_name)
---
INSERT INTO "ingredients" ("ingredient", "created_at", "updated_at") VALUES ('water', '2025-09-18 10:37:48.251181', '2025-09-18 10:37:48.251181') RETURNING "id"
SELECT "ingredients".* FROM "ingredients" WHERE (LOWER(ingredient) = 'water') LIMIT 1